{
  "required_state_variables": [
    "program_name",
    "program_name_raw",
    "requirements_loaded",
    "check_progress",
    "total_requirements",
    "fulfillment_status",
    "user_current_details",
    "current_step",
    "wizard_active"
  ],
  "routing_steps": [
    {
      "step_name": "identify_program",
      "fills_variable": "program_name",
      "type": "open_input",
      "question_text": {
        "english": "🧙 Which TU Berlin degree program are you interested in? Please provide the exact official name if you know it. Examples: \"Information Systems Management M.Sc.\", \"Architecture B.Sc.\"",
        "german": "🧙 Für welchen Studiengang der TU Berlin interessierst du dich? Bitte gib die offizielle Bezeichnung an, falls du sie kennst. Beispiele: \"Information Systems Management M.Sc.\", \"Architektur B.Sc.\""
      },
      "action": "FIRST: Scan the ENTIRE conversation history (including messages before the wizard was activated) for any program mentions. Look for phrases like \"I am interested in [program]\", \"masters [field]\", \"the [program] program\", etc. If a program is clearly mentioned: normalize it by matching against `study_program_webpages.json` using case-insensitive and partial matching, treating common abbreviations (ISM, CS, etc.) as aliases. If a unique match is found: (1) set program_name to the canonical title, (2) store the URL in user_current_details.program_url, (3) set current_step to 'load_admission_requirements', (4) proceed IMMEDIATELY to load_admission_requirements WITHOUT asking any questions. ONLY if you cannot find any program reference in the conversation history should you present the question_text. When the user answers, normalize their reply and proceed."
    },
    {
      "step_name": "load_admission_requirements",
      "fills_variable": "requirements_loaded",
      "type": "system",
      "question_text": {
        "english": null,
        "german": null
      },
      "action": "Generate search variants: full title, title without degree, German/English translations, abbreviations. Scan ALL FIVE stupo files for headings (## or ###) containing ALL of: (1) 'Studien', (2) 'Masterstudiengang' OR 'Bachelorstudiengang', (3) any search variant. Use case-insensitive partial matching. Once matched, extract from that heading to next same-level heading or end of file. Search extracted section for paragraphs with '§' + 'zugangsvoraussetzung'/'zulassungsvoraussetzung'/'voraussetzung'/'zugang' OR 'admission'/'prerequisite'/'eligibility'. Parse into requirements_checklist with: requirement_id, requirement_type, requirement_text, evaluation_criteria. Set total_requirements to checklist.length, check_progress to 0. If no match after all files, trigger inform_no_requirements_found. Proceed IMMEDIATELY to ask_requirements_questions."
    },
    {
      "step_name": "ask_requirements_questions",
      "fills_variable": "fulfillment_status",
      "type": "dynamic_questions",
      "max_questions": 8,
      "action": "Take user_current_details.requirements_checklist and, starting at the index stored in check_progress, generate user-facing questions in the user's language. Group related items (e.g., several ECTS requirements or document requirements) into a single combined question, but never group more than 4 items per question. Prefix each question with 🧙 and keep it short and direct. For each user answer: (1) If the answer is a clarification question or off-topic, respond appropriately without modifying wizard state, then re-ask the current question with '🧙 To continue with your eligibility check: [question]'. (2) If the answer is direct, acknowledge briefly with varied phrases: \"Got it.\", \"Thank you.\", \"Understood.\", \"Thanks.\", \"Noted.\" (EN) or \"Verstanden.\", \"Danke.\", \"Notiert.\", \"Alles klar.\" (DE). Rotate these phrases. CRITICAL: NEVER say \"I'm now processing your answers\", \"Let me evaluate\", \"One moment while I check\", or similar completion phrases. These cause the response to stop prematurely. Do not mention how many requirements remain and do not say \"this is the final requirement\" or \"one last question\". After acknowledging, evaluate the answer and update fulfillment_status with objects containing: requirement_id, requirement_text, status (\"fulfilled\"/\"unfulfilled\"/\"pending\"), user_input, notes. If user expressed uncertainty (\"I think\", \"probably\", \"maybe\", \"not sure\"), set status to \"pending\". Increase check_progress by the number of checklist items covered. Immediately proceed to the next question. When check_progress >= total_requirements, proceed directly to final_summary with NO transitional text."
    },
    {
      "step_name": "inform_no_requirements_found",
      "fills_variable": null,
      "type": "system",
      "question_text": {
        "english": null,
        "german": null
      },
      "action": "Use `study_program_webpages.json` to match program_name with a \"title\" field and read the corresponding \"url\" field (program_url). If no match found, use general programs page as fallback. In the user's language, inform them that you currently cannot find reliable information on the admission requirements for this program and direct them to the official program page. Include program_url and the admissions office contact: https://www.tu.berlin/en/studienberatung/studieninfoservice (EN) or https://www.tu.berlin/studienberatung/studieninfoservice (DE). Do not use emojis and do not offer additional services such as \"If you want, I can also help you with...\"."
    },
    {
      "step_name": "final_summary",
      "fills_variable": null,
      "type": "system",
      "question_text": {
        "english": null,
        "german": null
      },
      "action": "Use `study_program_webpages.json` to match program_name with a \"title\" field and read the corresponding \"url\" field (program_url). Based on fulfillment_status and user_current_details.requirements_checklist, generate the final eligibility summary in the user's language using the templates from eligibility_wizard_logic.md. Structure MUST be: (1) heading with 🧙 emoji and program name, (2) markdown table with columns: Requirement | Your Status | Notes / Next Steps, using status labels Fulfilled/Unfulfilled/Pending (EN) or Erfüllt/Nicht erfüllt/Offen (DE), (3) interpretation paragraph (2-4 sentences) summarizing overall eligibility, (4) \"Next steps\" section including program_url, (5) disclaimer paragraph with ⚠️ stating this is guidance only and official decisions are made by TU Berlin admissions office (include advisory URL: https://www.tu.berlin/en/studienberatung/studieninfoservice or German equivalent). CRITICAL: Start output immediately with the heading. Do NOT say \"Let me create your summary\" or similar transitional phrases. Do NOT add any text after the disclaimer. No offers of further help, no closing remarks. Use no emojis except 🧙 in heading and ⚠️ in disclaimer. Do not use horizontal rules."
    }
  ]
}