{
  "required_state_variables": [
    "program_name",
    "program_name_raw",
    "requirements_loaded",
    "check_progress",
    "total_requirements",
    "fulfillment_status",
    "user_current_details",
    "current_step",
    "wizard_active"
  ],
  "routing_steps": [
    {
      "step_name": "identify_program",
      "fills_variable": "program_name",
      "type": "open_input",
      "question_text": {
        "english": "🧙 Which TU Berlin degree program are you interested in? Please provide the exact official name if you know it. Examples: \"Information Systems Management M.Sc.\", \"Architecture B.Sc.\"",
        "german": "🧙 Für welchen Studiengang der TU Berlin interessierst du dich? Bitte gib die offizielle Bezeichnung an, falls du sie kennst. Beispiele: \"Information Systems Management M.Sc.\", \"Architektur B.Sc.\""
      },
      "action": "Scan the recent conversation for clear statements of intent such as \"I want to study...\" or \"I am interested in the Master's in...\". If you can confidently infer a single TU Berlin program from that context, normalize it by matching against the titles and aliases in `study_program_webpages.json` using case-insensitive and partial matching. If a unique match is found: (1) set program_name to the canonical title, (2) store the URL in user_current_details.program_url, (3) set current_step to 'load_admission_requirements', (4) proceed IMMEDIATELY to load_admission_requirements WITHOUT asking any program-related questions or confirmations. NEVER re-ask for program name once program_name is set. If you cannot infer a program, present the question_text in the user's language. When the user answers, normalize their reply by matching against `study_program_webpages.json`. If a clear match is found: (1) store the canonical program title in program_name, (2) set current_step to 'load_admission_requirements', (3) proceed to load_admission_requirements. If no clear match exists, store the raw user text in program_name and let later steps handle the \"not found\" case. CRITICAL: Never overwrite program_name with generic confirmations such as \"yes\", \"correct\", \"ja\", \"richtig\", \"ok\". Once program_name is set to a non-null value, the identify_program step is COMPLETE and must never be re-executed unless the user explicitly requests a different program."
    },
    {
      "step_name": "load_admission_requirements",
      "fills_variable": "requirements_loaded",
      "type": "system",
      "question_text": {
        "english": null,
        "german": null
      },
      "action": "CRITICAL: You MUST scan ALL FIVE stupo files completely: `study_program_stupos_01.md`, `study_program_stupos_02.md`, `study_program_stupos_03.md`, `study_program_stupos_04.md`, `study_program_stupos_05.md`. Before scanning, generate multiple search variants of program_name: (1) full canonical title, (2) title without degree suffix, (3) title with alternative degree formats (Master/MSc/M.Sc. or Bachelor/BSc/B.Sc.), (4) common abbreviations (e.g., ISM, CS), (5) German and English versions. Use case-insensitive and partial matching. Search each file systematically for sections whose heading or program description matches any search variant. Once the correct section is identified, scan for keywords: \"zugang\", \"zulassung\", \"zulassungsverfahren\", \"zugangsvoraussetzungen\", \"zulassungsantrag\" (German) or \"admission requirements\", \"entry requirements\", \"eligibility\", \"prerequisites\" (English). From the surrounding passages, derive an internal checklist of admission requirements (credits in subject areas, language certificates, documents, projects, work samples, professional experience). Store this checklist in user_current_details.requirements_checklist with structured items containing: requirement_id, requirement_type, requirement_text, evaluation_criteria. Set total_requirements to the checklist length and reset check_progress to 0. Log which file contained the match in user_current_details.scan_log. If no clear admission requirements can be derived after scanning all five files or no matching program section can be identified, do not set requirements_loaded to true and go to inform_no_requirements_found."
    },
    {
      "step_name": "ask_requirements_questions",
      "fills_variable": "fulfillment_status",
      "type": "dynamic_questions",
      "max_questions": 8,
      "action": "Take user_current_details.requirements_checklist and, starting at the index stored in check_progress, generate user-facing questions in the user's language. If the checklist contains more items than max_questions, group related items (e.g., several ECTS requirements or document requirements) into a single combined question, but never group more than 4 items per question. Prefix each question with 🧙 and keep it short and direct. For each user answer: (1) If the answer is a clarification question or off-topic, respond appropriately without modifying wizard state, then re-ask the current question with '🧙 To continue with your eligibility check: [question]'. (2) If the answer is direct, acknowledge briefly with varied phrases: \"Got it.\", \"Thank you.\", \"Understood.\", \"Thanks.\", \"Noted.\" (EN) or \"Verstanden.\", \"Danke.\", \"Notiert.\", \"Alles klar.\" (DE). Rotate these phrases. CRITICAL: NEVER say \"I'm now processing your answers\", \"Let me evaluate\", \"One moment while I check\", or similar completion phrases. These cause the response to stop prematurely. Do not mention how many requirements remain and do not say \"this is the final requirement\" or \"one last question\". After acknowledging, evaluate the answer and update fulfillment_status with objects containing: requirement_id, requirement_text, status (\"fulfilled\"/\"unfulfilled\"/\"pending\"), user_input, notes. If user expressed uncertainty (\"I think\", \"probably\", \"maybe\", \"not sure\"), set status to \"pending\". Increase check_progress by the number of checklist items covered. Immediately proceed to the next question. When check_progress >= total_requirements, proceed directly to final_summary with NO transitional text."
    },
    {
      "step_name": "inform_no_requirements_found",
      "fills_variable": null,
      "type": "system",
      "question_text": {
        "english": null,
        "german": null
      },
      "action": "Use `study_program_webpages.json` to match program_name with a \"title\" field and read the corresponding \"url\" field (program_url). If no match found, use general programs page as fallback. In the user's language, inform them that you currently cannot find reliable information on the admission requirements for this program and direct them to the official program page. Include program_url and the admissions office contact: https://www.tu.berlin/en/studienberatung/studieninfoservice (EN) or https://www.tu.berlin/studienberatung/studieninfoservice (DE). Do not use emojis and do not offer additional services such as \"If you want, I can also help you with...\"."
    },
    {
      "step_name": "final_summary",
      "fills_variable": null,
      "type": "system",
      "question_text": {
        "english": null,
        "german": null
      },
      "action": "Use `study_program_webpages.json` to match program_name with a \"title\" field and read the corresponding \"url\" field (program_url). Based on fulfillment_status and user_current_details.requirements_checklist, generate the final eligibility summary in the user's language using the templates from eligibility_wizard_logic.md. Structure MUST be: (1) heading with 🧙 emoji and program name, (2) markdown table with columns: Requirement | Your Status | Notes / Next Steps, using status labels Fulfilled/Unfulfilled/Pending (EN) or Erfüllt/Nicht erfüllt/Offen (DE), (3) interpretation paragraph (2-4 sentences) summarizing overall eligibility, (4) \"Next steps\" section including program_url, (5) disclaimer paragraph with ⚠️ stating this is guidance only and official decisions are made by TU Berlin admissions office (include advisory URL: https://www.tu.berlin/en/studienberatung/studieninfoservice or German equivalent). CRITICAL: Start output immediately with the heading. Do NOT say \"Let me create your summary\" or similar transitional phrases. Do NOT add any text after the disclaimer. No offers of further help, no closing remarks. Use no emojis except 🧙 in heading and ⚠️ in disclaimer. Do not use horizontal rules."
    }
  ]
}