{
  "required_state_variables": [
    "program_name",
    "requirements_loaded",
    "check_progress",
    "total_requirements",
    "fulfillment_status",
    "user_current_details"
  ],
  "routing_steps": [
    {
      "step_name": "identify_program",
      "fills_variable": "program_name",
      "type": "open_input",
      "question_text": {
        "english": "🧙 Which TU Berlin degree program are you interested in? Please provide the exact official name if you know it. Examples: \"Information Systems Management M.Sc.\", \"Architecture B.Sc.\"",
        "german": "🧙 Für welchen Studiengang der TU Berlin interessierst du dich? Bitte gib die offizielle Bezeichnung an, falls du sie kennst. Beispiele: „Information Systems Management M.Sc.“, „Architektur B.Sc.“"
      },
      "action": "First, infer the user's language (English or German) from their recent messages. Then scan the recent conversation for clear statements of intent such as \"I want to study ...\" or \"I am interested in the Master's in ...\". If you can confidently infer a single TU Berlin program from that context (for example \"masters ism\" clearly referring to \"Information Systems Management M.Sc.\" or \"masters architecture\" referring to the relevant Architecture program), normalize it by matching the inferred text against the titles in `study_program_webpages.json` (and any alias fields if available), using case-insensitive and partial matching. If a unique match is found, set program_name to this canonical title and proceed without asking an additional program question. Only if you cannot confidently infer a program from previous messages should you present the question_text in the user's language. When the user answers this question (for example with \"masters ism\" or \"masters information systems management\"), treat their reply as a raw label and again normalize it by matching against the titles in `study_program_webpages.json` using case-insensitive and partial matching, treating common abbreviations such as \"ISM\" as possible aliases. If you find a clear match, store the canonical program title (for example \"Information Systems Management M.Sc.\") in program_name. If no clear match exists, store the raw user text in program_name and let later steps handle the \"not found\" case. Never overwrite program_name with a generic confirmation such as \"yes\" or \"correct\"; confirmations must not be stored in program_name."
    },
    {
      "step_name": "load_admission_requirements",
      "fills_variable": "requirements_loaded",
      "type": "system",
      "question_text": {
        "english": null,
        "german": null
      },
      "action": "Use the current program_name as the basis to find the correct study program regulations. If possible, first consult `study_program_webpages.json` and match program_name to a \"title\" field (and any alias fields if available) using case-insensitive and partial matching, to obtain a canonical program title. Then scan all five stupo knowledge files: `study_program_stupos_01.md`, `study_program_stupos_02.md`, `study_program_stupos_03.md`, `study_program_stupos_04.md` and `study_program_stupos_05.md`. In these files, search for the section whose heading or program description best matches the canonical program title or, if no canonical title was found, the current program_name. Use case-insensitive and partial matching so that variants like \"masters ism\" or \"Master Information Systems Management\" can still be resolved to \"Information Systems Management M.Sc.\". Once the correct section is identified, scan the text for the keywords \"zugang\", \"zulassung\", \"zulassungsverfahren\", \"zugangsvoraussetzungen\" and \"zulassungsantrag\". From the surrounding passages, derive an internal checklist of admission requirements (for example: required number of credits in certain subject areas, required language certificates, required documents, required projects or work samples, required professional experience). Store this internal checklist inside user_current_details under the key \"requirements_checklist\". Set total_requirements to the number of items in this checklist and reset check_progress to 0. If no clear admission requirements can be derived or no matching program section can be identified, do not set requirements_loaded to true and go to the step inform_no_requirements_found."
    },
    {
      "step_name": "ask_requirements_questions",
      "fills_variable": "fulfillment_status",
      "type": "dynamic_questions",
      "max_questions": 5,
      "question_text": {
        "english": "Use the internal checklist of admission requirements to generate clear, user-facing questions in English. Aim to cover each checklist item, but if there are many items, group related requirements into combined questions. Example questions include: \"Do you have a certified English language certificate at level B2 or higher?\", \"How many ECTS do you have in subject area Y?\", \"Do you hold a completed Bachelor's degree in field X?\", \"Do you possess a valid higher education entrance qualification (for example, a high school diploma)?\" Prefix each question with the wizard emoji and keep the rest of the wording simple.",
        "german": "Nutze die interne Checkliste der Zulassungsvoraussetzungen, um klare, nutzerfreundliche Fragen auf Deutsch zu formulieren. Versuche, jeden Punkt der Checkliste abzudecken, gruppiere bei vielen Punkten aber verwandte Anforderungen in gemeinsamen Fragen. Beispielhafte Fragen sind: \"Hast du ein anerkanntes Englisch-Zertifikat auf Niveau B2 oder höher?\", \"Wie viele ECTS hast du im Fachbereich Y?\", \"Hast du einen abgeschlossenen Bachelorabschluss im Fach X?\", \"Hast du eine gültige Hochschulzugangsberechtigung (zum Beispiel ein Abitur)?\" Stelle jede Frage sachlich, beginne sie mit dem Zauberer-Emoji und verwende sonst keine weiteren Emojis."
      },
      "action": "Infer and use the user's language (English or German) based on their messages. Take user_current_details.requirements_checklist and, starting at the index stored in check_progress, generate user-facing questions in that language. Ask at most max_questions questions in total for one eligibility run. If the checklist contains more items than max_questions, group related items (for example, several ECTS requirements or several document requirements) into a single combined question, while still evaluating each checklist item internally based on the user's answer. Prefix each question with the wizard emoji and keep the question itself short and direct. For each user answer, briefly acknowledge it with a short phrase such as \"Thanks.\" or \"Noted.\" (in the user's language) but do not summarize or restate the content of their answer. Do not mention how many requirements remain and do not say things like \"this is the final requirement\" or \"one last question\". After acknowledging the answer, immediately proceed to the next question until all relevant checklist items have been covered. For every checklist item covered by a question, update fulfillment_status with objects that contain an identifier for each checklist item, a status such as \"fulfilled\", \"unfulfilled\" or \"pending\", and the raw user_input. Increase check_progress by the number of checklist items that were covered by that question. When check_progress is greater than or equal to total_requirements, proceed to the final_summary step."
    },
    {
      "step_name": "inform_no_requirements_found",
      "fills_variable": null,
      "type": "system",
      "question_text": {
        "english": null,
        "german": null
      },
      "action": "Infer the user's language from the conversation. If no clear admission requirements can be found in the stupo files or no reliable program section can be identified, use the file `study_program_webpages.json` to match program_name with a \"title\" field and read the corresponding \"url\" field (program_url). In the user's language, inform them in simple wording that you currently cannot find reliable information on the admission requirements for this program and direct them to the official study program page. Include program_url in the message. Do not use emojis and do not offer additional services such as \"If you want, I can also help you with...\"."
    },
    {
      "step_name": "final_summary",
      "fills_variable": null,
      "type": "system",
      "question_text": {
        "english": null,
        "german": null
      },
      "action": "Infer the user's language from the conversation. Use the file `study_program_webpages.json` to match program_name with a \"title\" field and read the corresponding \"url\" field (program_url). Based on fulfillment_status and the internal checklist stored in user_current_details.requirements_checklist, generate the final eligibility summary in the user's language. Structure the output strictly as follows: (1) a heading line with the wizard emoji and the program name, (2) a markdown table listing each requirement, the user's status (fulfilled / unfulfilled / pending) and short notes or next steps, (3) a short interpretation paragraph summarizing the overall situation, (4) a \"Next steps\" paragraph or short list that includes program_url, and (5) a disclaimer paragraph stating that this is guidance only and that the official admission decision is made by TU Berlin (also mentioning the central advisory URL). Do not add any extra text such as offers of further help (for example, do not say \"If you want, I can also help you with...\"). Use no emojis except for the wizard emoji in the heading. Do not use horizontal rules. Keep formatting simple and only use the table specified plus normal paragraphs and bullet lists where appropriate."
    }
  ]
}
